yoga416/CH32V307_SmartMedBox_FreeRTOS/User/app_task.c
#include "app_task.h"
#include "debug.h"
#include "string.h"
#include "Middle_ring_buffer.h"
#include "ch32v30x_iwdg.h"

/* 控制本文件的调试打印：0=关闭，1=开启 */
#ifndef APP_DEBUG_PRINT
#define APP_DEBUG_PRINT 0
#endif

#if APP_DEBUG_PRINT
#define APP_LOG(...)    printf(__VA_ARGS__)
#else
#define APP_LOG(...)    ((void)0)
#endif

// 传感器相关的 handler 和 port
#include "sht40_handler.h"
#include "../bsp/sht40/sht40_port.h"
#include "../bsp/bsp_MLX_90614/bsp_MLX_90614_handler.h"
#include "../bsp/bsp_MLX_90614/bsp_MLX_90614_port.h"
#include "../bsp/bsp_max_30102/bsp_max_30102_handler.h"
#include "../bsp/bsp_max_30102/bsp_max_30102_port.h"
#include "../bsp/bsp_max_30102/bsp_max_30102_reg.h"
#include "../bsp/bsp_a7670c/bsp_a7670c.h"
#include "../bsp/usart_wifi_esp/usart_wifi_esp.h"
#include "../bsp_rtc/bsp_rtc.h"
#include "../bsp/bsp_tianwen/bsp_tianwen_reg.h"
#include "../bsp/bsp_rtc/bsp_rtc.h"      // 解决 BSP_RTC_Init 报错

#include "debug.h"
#include "system.h"
#include "lcd.h"      // 添加 LCD 头文件
#include "touch.h"
#include "ctpiic.h"
#include <stdio.h>
#include <string.h>
#include "lvgl.h"
#include "lv_port_disp.h"
#include "lv_port_indev.h"
#include "lv_port_indev.h"
#include "information.h"
#include "gui_guider.h"
#include "events_init.h"
#include "facial.h"
#include "facial_reg.h"
/* 触摸屏扫描（FT6336 软件 I2C） */
#include "touch.h"


//////////////////////////
RingBuffer_t g_ring_buffer = {0};
QueueHandle_t xUART_Queue = NULL;
SemaphoreHandle_t xDMA_Sem = 0;
SemaphoreHandle_t xBufferDataSemaphore = NULL;
QueueHandle_t xSysCmdQueue = NULL; // 系统命令队列
QueueHandle_t CmdQueue = NULL; // 系统命令队列
QueueHandle_t sendtianwenQueue = NULL; // 天问通信命令队列
QueueHandle_t sensor_data_lcd_queue = NULL; // 传感器数据队列
SemaphoreHandle_t xGuiMutex = NULL; // LVGL 互斥锁，防止多任务并发访问 GUI
EventGroupHandle_t xWatchdogEventGroup = NULL; // 看门狗事件组
SemaphoreHandle_t xSem_face_recog;// 人脸识别检测开始同步信号量
SemaphoreHandle_t xSem_face_result_yes; // 人脸识别结果信号量(识别成功)
SemaphoreHandle_t xSem_face_result_no; // 人脸识别结果信号量(识别失败)
SemaphoreHandle_t xSem_face_add; // 人脸添加开始同步信号量
SemaphoreHandle_t xSem_face_add_result; // 人脸添加结果同步信号量
SemaphoreHandle_t xSem_Btn_Eat; // 吃药按钮按下同步信号量

/* 任务句柄 */
TaskHandle_t bspSensorTask_Handler;
TaskHandle_t appTask_Handler;
TaskHandle_t usartTask_Handler;
TaskHandle_t watchdogTask_Handler;
TaskHandle_t tianwenTask_Handler;
TaskHandle_t lcdTask_Handler; // 如果有 LCD 任务的话


 extern volatile uint8_t a7670c_ready; // 在A7670C初始化完成后置1
 extern SystemCommand_t received_cmd;
 extern AlarmSche my_meds[3]; // 从 bsp_rtc.h 中 extern 引入吃药时间表
 extern uint8_t g_current_active_user_id; // 当前活跃用户ID
 extern void custom_bind_time_labels(void);  
 UI_DisplayData_t g_ui_data[MAX_USER]; // 全局 UI 数据结构实例
// 在主循环中处理接收
FR_packet_t rx_pkt;
 static TickType_t last_check_mechine_time = 0;

void check_medication_time(void); // 声明检查吃药时间的函数

void app_task(void *pvParameters)
{
//主函数。逻辑函数，根据系统指令执行相应的操作
    (void)pvParameters;
    APP_LOG("\n[App] Smart Medicine Box Started\n");
    // 初始化漏服记录

    //发送开机语音播报命令到天问模块
    Tianwen_Packet_t tianwen_packet;
    tianwen_packet.id = CMD_TX_BOOT_VOICE; // 定义一个新的指令，比如 CMD_TX_BOOT_VOICE
    tianwen_packet.data_len = 0; // 没有额外数据(命令帧)
    xQueueSend(sendtianwenQueue, &tianwen_packet, portMAX_DELAY); // 确保开机播报命令一定能发送出去

    //设置时间：
    BSP_RTC_ModifyTime(current_time_virvual[0], current_time_virvual[1], current_time_virvual[2], current_time_virvual[3], current_time_virvual[4], current_time_virvual[5]); // 设置初始时间为2026年3月2日23:59:00
    //设置闹钟(已经设置就生效，所以放在主循环前面)
    ///BSP_RTC_UpdateNextAlarm(); // 根据 my_meds 数组设置第一个闹钟

    //定义一个变量来跟踪当前检查的吃药时间索引
   AppMsg_t msg;
    AppMsg_t msg_FR;
    // uint32_t last_time = 0; // 移除未使用的变量
    for (;;)
    {
       
        BaseType_t ret = xQueueReceive(xAppEventQueue, &msg, pdMS_TO_TICKS(10));

        if (ret == pdPASS) 
        {
            // 收到具体事件，开始处理分支
            switch (msg.event_id) 
            {
                case MSG_FACE_RECOG_START:// 人脸识别开始事件
                    APP_LOG("[App] Event: Face recognition started\n");
                    // 模拟：给系统自己发一个成功事件（实战中这应该由串口中断发）
                    // AppMsg_t sim_msg = { .event_id = MSG_FACE_RECOG_SUCCESS };
                    // xQueueSend(xAppEventQueue, &sim_msg, 0);
                    break;

               case MSG_FACE_RECOG_SUCCESS:// 人脸识别成功事件
                    /*切换用户前，保存旧用户的数据*/
                    SystemData_Save_To_Flash_ByUser(g_current_active_user_id);
                    
                    /* 更新为新识别到的用户ID */
                    g_current_active_user_id = msg.data[2]; 
                    APP_LOG("[App] Recognized User ID: %d\n", g_current_active_user_id);
                    
                    // 【新增核心代码】：把新用户的吃药时间瞬间同步给后台的闹钟数组！
                    memcpy(my_meds, g_ui_data[g_current_active_user_id].meds_schedule, sizeof(my_meds));
                    
                    // 更新界面显示
                    g_ui_data[g_current_active_user_id].update_flags |= UI_FLAG_USER_STEP;
                    g_ui_data[g_current_active_user_id].update_flags |= UI_FLAG_SCHEDULE; // 【新增】：让屏幕上的 08:30 等数字立即刷新成新用户的
                    
                    APP_LOG("[App] Event: Face recognition Success\n");
                    tianwen_packet.id = CMD_TX_REGISTERED_USER; 
                    xQueueSend(sendtianwenQueue, &tianwen_packet, 0); 
                    break;

                case MSG_FACE_RECOG_FAIL:// 人脸识别失败事件
                    APP_LOG("[App] Event: Face recognition Fail\n");
                    tianwen_packet.id = CMD_TX_UNREGISTERED; 
                    xQueueSend(sendtianwenQueue, &tianwen_packet, 0); 
                    break;

                case MSG_FACE_ADD_FAIL:// 人脸添加失败事件
                    APP_LOG("[App] Event: Face add Fail\n");
                    break;

                
                // ... 处理其他事件 ...
                default:
                    break;
            }
        }
        //    // /*测试串口发送5s发一次*/
        // if(xTaskGetTickCount() - last_time >= pdMS_TO_TICKS(5000)) {
        //     last_time = xTaskGetTickCount();
        // FR_packet_t test_pkt;
        // test_pkt.sensor_id = 0x00; // 模拟一个传感器ID
        // test_pkt.data_len = 3; // 模拟3字节数据
        // test_pkt.payload[0] = 0x01; // 模拟命令：注册(0x00)/识别(0x01)
        // test_pkt.payload[1] = 0x01; // 模拟结果：注册失败(0x03)/识别失败(0x00)，注册成功(0x00)/识别成功(0x01)
        // test_pkt.payload[2] = 0x02; // 模拟用户ID 0x00//0x01/0x02...
        // FR_SendPacket((FR_packet_t *)&test_pkt); // 发送到 ESP8266
        // }

        /*接收人脸识别的数据*/
        if (FR_ReceivePacket_Block(&rx_pkt, pdMS_TO_TICKS(100))==0) {
         if ( rx_pkt.data_len >= 1)
         {
            /* payload[0]: 命令 (0：注册，1：识别) */
            /* payload[1]: 识别结果 (0：失败, 1：成功)/注册结果（2：成功，3：失败） */
            /* payload[2]: 用户ID */ 
            if (rx_pkt.payload[0] == 0x00) { // 注册相关
                if (rx_pkt.payload[1] == 0x02) {
                    msg_FR.event_id = MSG_FACE_ADD_SUCCESS;
                    xQueueSend(xAppEventQueue, &msg_FR, 0);
                    // 可以在这里更新 UI 或者执行其他逻辑
                } else if (rx_pkt.payload[1] == 0x03) {
                    msg_FR.event_id = MSG_FACE_ADD_FAIL;
                    xQueueSend(xAppEventQueue, &msg_FR, 0);
                }
            } else if (rx_pkt.payload[0] == 0x01) { // 识别相关
                if (rx_pkt.payload[1] == 0x01) {
                    msg_FR.event_id = MSG_FACE_RECOG_SUCCESS;
                    msg_FR.data[2] = rx_pkt.payload[2]; 
                    xQueueSend(xAppEventQueue, &msg_FR, 0);
                    // 可以在这里更新 UI 或者执行其他逻辑
                } else if (rx_pkt.payload[1] == 0x00) {
                    msg_FR.event_id = MSG_FACE_RECOG_FAIL;
                    xQueueSend(xAppEventQueue, &msg_FR, 0);
                }
            }   
         }
        }

        //设置看门狗事件位，表示 app_task 正常运行
        xEventGroupSetBits(xWatchdogEventGroup, WDOG_BIT_APP_TASK);
        vTaskDelay(pdMS_TO_TICKS(5)); // 每20ms检查一次事件队列和喂一次狗
    }
}


void lcd_task(void *pvParameters)
{
    for(;;) {

        if(xSemaphoreTake(xGuiMutex, portMAX_DELAY) == pdTRUE) {
            lv_tick_inc(10);      // 先递增 LVGL tick
            lv_timer_handler();  // 处理 LVGL 定时器
            xSemaphoreGive(xGuiMutex);
        }
        //设置看门狗事件位，表示 lcd_task 正常运行
        xEventGroupSetBits(xWatchdogEventGroup, WDOG_BIT_LCD_TASK);
        vTaskDelay(pdMS_TO_TICKS(5)); // 每5ms更新一次 LCD
    }
}


