yoga416/CH32V307_SmartMedBox_FreeRTOS/User/app_task.c
                case CMD_MEASURE_ENV_TEMP_HUMI:
                    //APP_LOG("[App] Received CMD: Measure Env Temp & Humidity\n");
                    if (g_temp_humi_handler_instance != NULL) {
                        temp_humi_event_t sht_evt;
                        sht_evt.event_type = TEMP_HUMI_EVENT_BOTH;
                        sht_evt.lifetime = 500;
                        sht_evt.pf_callback = on_SHT40_DATA_ready;
                        bsp_temp_humi_handler_t *h_sht = (bsp_temp_humi_handler_t *)g_temp_humi_handler_instance;
                        h_sht->os_interface->os_queue_put(h_sht->event_queue_handle, &sht_evt, 10);
                    }
                    break;

                case CMD_SEND_SMS_ALERT:
                    // APP_LOG("[App] Received CMD: Send SMS Alert\n");
                    // if (!a7670c_ready) {
                    //     printf("[App] A7670C not ready, cannot send SMS!\n");
                    //     break;
                    // }
                    // A7670C_WakeUp();
                    // APP_LOG("--- Alert triggered: Sending SMS ---\r\n");
                    // A7670C_SendSMS_Auto("18135183446", "请按时服药！");
                    // vTaskDelay(pdMS_TO_TICKS(1000));
                    // A7670C_EnterSleep();
                    // APP_LOG("--- SMS sent, module sleeping ---\r\n");
                    break;

                default:
                    break;
            }
        }
     
         //设置看门狗事件位，表示 bsp_sensor_task 正常运行
        xEventGroupSetBits(xWatchdogEventGroup, WDOG_BIT_SENSOR_TASK);
        vTaskDelay(pdMS_TO_TICKS(5)); // 每5ms检查一次系统指令队列
    }
}

/* -------------------------------------------------------------
 * 3. WIFI 数据上传与指令接收任务
 * ------------------------------------------------------------- */
void usart_task(void *pvParameters)
{
    Packet_t packet;
    Packet_t rx_packet;
    static TickType_t last_sync_tick = 0;  // 记录上次同步时间
    static uint8_t is_first_sync = 1;      // 首次同步标志
    static TickType_t last_wifi_tick = 0;  // 记录上次收到WiFi状态的时间
    (void)pvParameters;
    for (;;)
    {
    

        // 1. 发送逻辑：处理 RingBuffer 中的待发送数据
        while (RingBuffer_isEmpty(&g_ring_buffer) == 0x00)
        {
            if (RingBuffer_pop(&g_ring_buffer, &packet) == 0xAF)
            {
                if (USART_WIFI_ESP_Send(&packet) != USART_WIFI_ESP_OK) {
                    printf("[usart_task] Failed to send packet to ESP8266\n");
                }
            }
            vTaskDelay(pdMS_TO_TICKS(5));
            if (watchdogTask_Handler != NULL) {
                xTaskNotifyGive(watchdogTask_Handler);
            }
        }

        // 2. 接收逻辑：从 WiFi 接收指令包 (包含时间同步指令)
        if (USART_WIFI_ESP_Receive(&rx_packet) == USART_WIFI_ESP_OK)
        {

            /*时间同步*/
            if (rx_packet.sensor_id == CMD_RTC_SYNC && rx_packet.data_len >= 6)
            {
                uint8_t year   = rx_packet.payload[0];
                uint8_t month  = rx_packet.payload[1];
                uint8_t day    = rx_packet.payload[2];
                uint8_t hour   = rx_packet.payload[3];
                uint8_t minute = rx_packet.payload[4];
                uint8_t second = rx_packet.payload[5];

                TickType_t current_tick = xTaskGetTickCount();
                
                // 每200秒校准一次误差 (首次或者间隔超过200,000ms)
                if (is_first_sync || (current_tick - last_sync_tick) >= pdMS_TO_TICKS(20000))
                {
                    // 修改 RTC 时间
                    BSP_RTC_ModifyTime(2000 + year, month, day, hour, minute, second);
                    
                    last_sync_tick = current_tick;
                    is_first_sync = 0;

                    // 立即更新 LCD 显示的时间
                    BSP_RTC_GetDateTime(&g_ui_data[g_current_active_user_id].time);
                    g_ui_data[g_current_active_user_id].update_flags |= UI_FLAG_TIME;
                    
                    printf("[Time Sync] RTC & LCD display calibrated successfully!\n");
                }
            }

            /*位置同步*/
            if (rx_packet.sensor_id == CMD_LOCATION_SYNC && rx_packet.data_len >= 8)
            {
                char city_name[16]={0};
                memcpy(city_name, rx_packet.payload, rx_packet.data_len);
                APP_LOG("\r\n[Location Sync] Received new location: %s\n", city_name);
                /*保存在w25qxx中*/
                //W25Q_WriteData(LOCATION_STORAGE_ADDR, (uint8_t*)city_name, 16);
            }

            /*天气同步*/
            if (rx_packet.sensor_id == CMD_WEATHER_SYNC && rx_packet.data_len >= 2)
            {
                int8_t weather_code= (int8_t)rx_packet.payload[0]; // 天气代码
                // 心知天气官方代码参考
                    switch(weather_code) {
                            case 0: APP_LOG("weather: clear"); break;
                            case 4: APP_LOG("weather: cloudy"); break; // 4 对应多云
                            case 6: APP_LOG("weather: overcast"); break;
                            case 9: APP_LOG("weather: partly cloudy"); break;
                            case 10: APP_LOG("weather: shower"); break;
                            // ... 更多代码
                            default:  break;
                            }
                int8_t temperature = (int8_t)rx_packet.payload[1]; // 温度
                APP_LOG("\r\n[Weather Sync] Received weather update: Temp=%d°C\n", temperature);
                /*可以根据天气代码更新 LCD 上的天气图标，温度可以显示在天气图标旁边*/
                /*保存在w25qxx中*/
                //W25Q_WriteData(LOCATION_STORAGE_ADDR, (uint8_t*)city_name, 16);
            }

            /*wifi状态更新*/
            if (rx_packet.sensor_id == CMD_WIFI_STATUS_UPDATE)
            {
                
                //APP_LOG("[WiFi] Status update received: 0x%02X\n", rx_packet.payload[0]);
                if(rx_packet.payload[0] == 0x32) {
                    // 接收到心跳包，说明模块在线，更新 WiFi 状态和最后收到状态的时间戳
                    last_wifi_tick = xTaskGetTickCount();
                    g_ui_data[g_current_active_user_id].wifi_status = 0; // 0 表示 WiFi 已连接
                } else {
                    g_ui_data[g_current_active_user_id].wifi_status = 1; // 1 表示 WiFi 断开
                }
                g_ui_data[g_current_active_user_id].update_flags |= UI_FLAG_WIFI; // 触发 UI 刷新
            }
        }
       // ==========================================
        // 3. 独立的心跳超时检测逻辑 (放在接收 if 块的外面)
        // ==========================================
        /* 串口 20s 内没有接收到任何数据时，把 wifi_status 设置为 'F' */
        if(g_ui_data[g_current_active_user_id].wifi_status == 0) 
        {
            if ((xTaskGetTickCount() - last_wifi_tick) >= pdMS_TO_TICKS(20000)) 
            {
                APP_LOG("[WiFi] No status update received for 20s, setting status to 'off'\n");
                g_ui_data[g_current_active_user_id].wifi_status = 1;
                g_ui_data[g_current_active_user_id].update_flags |= UI_FLAG_WIFI; // 触发 UI 刷新
            }
        }
        //设置看门狗事件位，表示 usart_task 正常运行
        xEventGroupSetBits(xWatchdogEventGroup, WDOG_BIT_USART_TASK);
        vTaskDelay(pdMS_TO_TICKS(5));
    }
    }



void vApplicationMallocFailedHook(void)
{
    taskDISABLE_INTERRUPTS();
    APP_LOG("[Error] Malloc Failed\n");
    while (1){}
}

