yoga416/CH32V307_SmartMedBox_FreeRTOS/User/app_task.c
/* 看门狗喂狗任务：定期喂独立看门狗，防止系统卡死 */
void watchdog_task(void *pvParameters)
{
    (void)pvParameters;
    for(;;)
    {
        if(WDOG_BIT_ALL_TASKS == (xEventGroupGetBits(xWatchdogEventGroup) & WDOG_BIT_ALL_TASKS)) {

             IWDG_ReloadCounter(); // 喂独立看门狗
            xEventGroupClearBits(xWatchdogEventGroup, WDOG_BIT_ALL_TASKS); // 清除所有任务位，准备下一轮监测
        }
            vTaskDelay(pdMS_TO_TICKS(100));
    }

}

/*规定时间为前后10分钟*/ // 注：代码里写的是 +/- 1分钟
void check_medication_time(void) {
    RTC_TimeTypeDef current_time;
    BSP_RTC_GetDateTime(&current_time);
    
    int16_t curr_total_mins = current_time.hour * 60 + current_time.min;
    
    Tianwen_Packet_t tw_pkt;
    tw_pkt.data_len = 0;
    
    uint8_t is_time_to_eat = 0; 
    int8_t active_med_idx = -1; // 新增：记录当前是哪一顿药触发了时间
    
    //APP_LOG("[App] Checking medication time... Current time: %02d:%02d\n", current_time.hour, current_time.min);
    
    // 遍历检查设定的3个吃药时间
    for (int i = 0; i < MAX_SCHE; i++) {
        int16_t target_total_mins = my_meds[i].hour * 60 + my_meds[i].min;
        int16_t diff_mins = curr_total_mins - target_total_mins;
        
        // 处理跨天的情况
        if (diff_mins > 12 * 60) diff_mins -= 24 * 60;
        else if (diff_mins < -12 * 60) diff_mins += 24 * 60;
        
        // 只要查到有一顿药在 +/-1 分钟内
        if (diff_mins >= -1 && diff_mins <= 1) {
            is_time_to_eat = 1; 
            active_med_idx = i; // 把当前触发的这顿药的编号记下来
            break; 
        }
    }
    
    if (is_time_to_eat) {
        // 新增：使用静态变量记录上一次重置状态的【日期】和【药品索引】
        static int8_t last_reset_med_idx = -1;
        static uint8_t last_reset_day = 0xFF;

        // 核心判断：如果今天还没有为这顿药重置过状态，才执行重置和存 Flash
        if (last_reset_day != current_time.day || last_reset_med_idx != active_med_idx) {
            
            g_ui_data[g_current_active_user_id].meds_completed[0] = 0;
            g_ui_data[g_current_active_user_id].meds_completed[1] = 0;
            g_ui_data[g_current_active_user_id].meds_completed[2] = 0;

            g_ui_data[g_current_active_user_id].med_status[0] = 0;
            g_ui_data[g_current_active_user_id].med_status[1] = 0;    
            g_ui_data[g_current_active_user_id].med_status[2] = 0;    
            
            /*并保存到Flash*/
            SystemData_Save_To_Flash_ByUser(g_current_active_user_id);
            
            // 更新记录，打上“已处理”的标签
            last_reset_med_idx = active_med_idx;
            last_reset_day = current_time.day;

             g_ui_data[g_current_active_user_id].screen_3_update_step = true;  
            tw_pkt.id = CMD_TX_TIME_TO_EAT; 
        }

        // 下面这些 UI 刷新和语音指令，依然每次都执行，保证在这 3 分钟内屏幕一直停留在吃药界面
       
    } else {
        g_ui_data[g_current_active_user_id].screen_3_update_step = false;  
    }
    
    // 统一发送一次队列消息
    xQueueSend(sendtianwenQueue, &tw_pkt, 0); 
}